Revit 2024 API
Opening.BoundaryRect Property
Retrieves the geometry information if the opening boundary is a rect.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public IList<XYZ> BoundaryRect { get; }
Visual Basic
Public ReadOnly Property BoundaryRect As IList(Of XYZ)
	Get
Visual C++
public:
property IList<XYZ^>^ BoundaryRect {
	IList<XYZ^>^ get ();
}
Remarks
If IsRectBoundary is false, this value is null.
See Also
Opening Class
Autodesk.Revit.DB Namespace